import random
n1=random.randint(1,100)
print('Санды болжау ойынына қош келдіңіз')
def is_valid(n):
    return n.isdigit() and 1<=int(n)<=100
while True:
    s=input('1 мен 100 аралығындағы сан енгізіңіз:')
    if not is_valid(s):
        print('Мүмкін 1 мен 100 арасындағы сандарды енгізерміз?')
        continue
    g=int(s)
    if g>n1:
        print('Сіздің саныңыз жасырылған саннан үлкен,тағы да байқап көріңіз')
    elif g<n1:
        print('Сіздің саныңыз жасырылған саннан кіші,тағы да байқап көріңіз')
    else:
        print('Сіз дұрыс таптыңыз,құттықтаймыз!')
        break
print('Санды болжау ойынына қатысқаныңызға рақмет,көріскенше...')